<?xml version="1.0" ?><policyDefinitionResources revision="1.0" schemaVersion="1.0" xmlns="http://www.microsoft.com/GroupPolicy/PolicyDefinitions"><!--microsoft_edge version: 109.0.1518.49--><displayName/><description/><resources><stringTable><string id="WebView2LoaderOverrideSettings_group">Impostazioni override caricatore</string><string id="BrowserExecutableFolder">Configura il percorso della cartella eseguibile del browser</string><string id="BrowserExecutableFolder_Explain">Questo criterio consente di configurare le applicazioni WebView2 per utilizzare il runtime WebView2 nel percorso specificato. La cartella deve contenere i file seguenti: msedgewebview2.exe, msedge.dll e così via.

Per impostare il valore per il percorso della cartella, specificare un nome del valore e una coppia di valori. Imposta il nome del valore con l'ID modello utente applicazione o il nome del file eseguibile. Puoi utilizzare il carattere jolly &quot;*&quot; come nome valore da applicare a tutte le applicazioni.

Valore di esempio:

Name: *, Value: C:\Program Files\Microsoft Edge WebView2 Runtime Redistributable 85.0.541.0 x64</string><string id="BrowserExecutableFolderDesc">Configura il percorso della cartella eseguibile del browser</string><string id="ReleaseChannelPreference">Imposta le preferenze dell'ordine di ricerca del canale di rilascio</string><string id="ReleaseChannelPreference_Explain">L'ordine di ricerca del canale predefinito è WebView2 Runtime, Beta, Dev e Canary.

Per invertire l'ordine di ricerca predefinito, imposta questo criterio su 1.

Per impostare il valore della preferenza per il canale di rilascio, specifica un nome e una coppia di valori. Imposta il nome del valore con l'ID modello utente applicazione o sul nome del file eseguibile. Puoi usare il carattere jolly &quot;*&quot; come nome del valore da applicare a tutte le applicazioni.

Valore di esempio:

Name: *, Value: 1</string><string id="ReleaseChannelPreferenceDesc">Imposta le preferenze dell'ordine di ricerca del canale di rilascio</string><string id="ExperimentationAndConfigurationServiceControl">Controlla le comunicazioni con il Servizio di sperimentazione e configurazione</string><string id="ExperimentationAndConfigurationServiceControl_Explain">Il Servizio di sperimentazione e configurazione viene utilizzato per distribuire il payload di sperimentazione e configurazione al cliente.

     Il payload di sperimentazione è costituito dall'elenco delle prime funzionalità di sviluppo che Microsoft abilita per il testing e il feedback.

     Il payload di configurazione è costituito dall'elenco delle impostazioni che Microsoft desidera distribuire in per ottimizzare l'esperienza utente.

Ad esempio, il payload di configurazione potrebbe anche contenere un elenco di azioni da intraprendere su alcuni domini per motivi di compatibilità. Ad esempio, il browser potrebbe ignorare la stringa Agente utente su un sito Web se tale sito Web è danneggiato. Ognuna di queste azioni è destinata ad essere temporanea mentre Microsoft tenta di risolvere il problema con il proprietario del sito.

     Se imposti questi criteri sulla modalità &quot;Modalità estesa&quot;, viene scaricato il payload completo dal Servizio di sperimentazione e configurazione, ossia il payload di entrambe sperimentazione e configurazione.

     Se imposti questi criteri sulla modalità &quot;Solo configurazioni&quot;, viene scaricato solo il payload di configurazione.

     Se imposti questi criteri su &quot;Modalità con restrizioni&quot;, le comunicazioni con il Servizio di sperimentazione e configurazione vengono completamente interrotte. Microsoft non consiglia questa impostazione.

     Se non configuri questi criteri in un dispositivo gestito, il comportamento nei canali Beta e Stabile è lo stesso di “ConfigurationsOnlyMode”. Nei canali Canary e Dev il comportamento è lo stesso di “FullMode”.

     Se non configuri questi criteri, il comportamento è quello di “FullMode”.

Mappatura opzioni criteri:

* FullMode (2) = Recupera configurazioni ed esperimenti

* ConfigurationsOnlyMode (1) = Recupera solo configurazioni

* RestrictedMode (0) = Disabilita le comunicazioni con il Servizio di sperimentazione e configurazione

Utilizzare le informazioni precedenti durante la configurazione di questo criterio.</string><string id="ExperimentationAndConfigurationServiceControl_FullMode">Recupera configurazioni ed esperimenti</string><string id="ExperimentationAndConfigurationServiceControl_ConfigurationsOnlyMode">Recupera solo configurazioni</string><string id="ExperimentationAndConfigurationServiceControl_RestrictedMode">Disabilita le comunicazioni con il Servizio di sperimentazione e configurazione</string><string id="SUPPORTED_WIN7_V97">Microsoft Edge versione 97, Windows 7 o versione successiva</string><string id="SUPPORTED_WIN7_V87">Microsoft Edge versione 87, Windows 7 o versione successiva</string><string id="microsoft_edge_webview2">Microsoft Edge WebView2</string><string id="microsoft_edge_webview2_recommended">Microsoft Edge WebView2 - Impostazioni predefinite (sostituibili dagli utenti)</string></stringTable><presentationTable><presentation id="BrowserExecutableFolder"><listBox refId="BrowserExecutableFolderDesc">Impostare il nome del valore sull'ID del modello utente dell'applicazione o il nome del file eseguibile. È possibile utilizzare il carattere jolly &quot;*&quot; come nome valore da applicare a tutte le applicazioni.</listBox></presentation><presentation id="ReleaseChannelPreference"><listBox refId="ReleaseChannelPreferenceDesc">Impostare il nome del valore sull'ID del modello utente dell'applicazione o il nome del file eseguibile. È possibile utilizzare il carattere jolly &quot;*&quot; come nome valore da applicare a tutte le applicazioni.</listBox></presentation><presentation id="ExperimentationAndConfigurationServiceControl"><dropdownList refId="ExperimentationAndConfigurationServiceControl">Controlla le comunicazioni con il Servizio di sperimentazione e configurazione</dropdownList></presentation></presentationTable></resources></policyDefinitionResources>